WcfMovieService/Examples/Forrest Gump.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:wcf="http://schemas.datacontract.org/2004/07/WcfMovieService">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:AddMovie>
         <tem:movie>
            <wcf:Code>MDE2143658</wcf:Code>
            <wcf:Director>Robert Zemeckis</wcf:Director>
            <wcf:Id>0</wcf:Id>
            <wcf:Title>Forrest Gump</wcf:Title>
            <wcf:Year>1994</wcf:Year>
         </tem:movie>
      </tem:AddMovie>
   </soapenv:Body>
</soapenv:Envelope>